home/app/Controllers/Admin/Dashboard.php

        $data = [
            'participants' => $participantModel->orderBy('participants.created_at', 'DESC')->paginate(20),
            'pager' => $participantModel->pager,
            'webinars' => $webinarModel->findAll(),
---
SELECT *
FROM `webinars`