home/app/Controllers/Admin/Dashboard.php

SELECT *
FROM `webinars`
---
            ->findAll();

        //  Données envoyées à la vue
        $data = [
            'participants' => $participants,
            'webinars'     => $webinarModel->findAll(),
            'filters'      => [
                'search'     => $search,
                'city'       => $city,
                'webinar_id' => $webinarId,
            ]
        ];