home/app/Controllers/Registration.php

SELECT *
FROM `webinars`
WHERE `webinars`.`id` = '2'
---
    public function success($webinarId = null)
    {
        if (!$webinarId) {
            return redirect()->to(base_url());
        }

        $webinarModel = new WebinarModel();
        $webinar = $webinarModel->find($webinarId);