home/app/Controllers/Registration.php

SELECT *
FROM `webinars`
WHERE `webinars`.`id` = '2'
SELECT *
FROM `webinars`
WHERE `date_time` >= '2026-02-13 13:25:04'
ORDER BY `date_time` ASC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `participants`
WHERE `webinar_id` = '2'
---
    public function index($webinarId = null)
    {
        $webinarModel = new WebinarModel();

        if ($webinarId) {
            $webinar = $webinarModel->find($webinarId);
        }
        else {
            // Get next webinar if no ID provided
            $webinar = $webinarModel->where('date_time >=', date('Y-m-d H:i:s'))
                ->orderBy('date_time', 'ASC')
                ->first();
        }

        if (!$webinar) {
            return redirect()->to(base_url())->with('error', 'Aucun webinaire disponible pour l\'inscription.');
        }

        $participantModel = new ParticipantModel();
        $registeredCount = $participantModel->where('webinar_id', $webinar['id'])->countAllResults();

SELECT *
FROM `webinars`
WHERE `webinars`.`id` = '2'
---
    public function create()
    {
        $webinarID = $this->request->getPost('webinar_id');

        // Basic validation for webinar ID existence
        if (!$webinarID) {
            return redirect()->to(base_url())->with('error', 'Identifiant du webinaire manquant.');
        }

        $model = new ParticipantModel();
        $webinarModel = new WebinarModel();

        $webinar = $webinarModel->find($webinarID);

SELECT *
FROM `webinars`
WHERE `webinars`.`id` = '1'
---
    public function success($webinarId = null)
    {
        if (!$webinarId) {
            return redirect()->to(base_url());
        }

        $webinarModel = new WebinarModel();
        $webinar = $webinarModel->find($webinarId);