m-academie/app/Controllers/Home.php

    public function index()
    {
        $model = new WebinarModel();

        // Get the next upcoming webinar
        // Since we might not have data yet, handle null gracefully in view
        $nextWebinar = $model->where('date_time >=', date('Y-m-d H:i:s'))
            ->orderBy('date_time', 'ASC')
            ->first();
---
SELECT *
FROM `webinars`
WHERE `date_time` >= '2026-02-05 15:42:14'
ORDER BY `date_time` ASC
 LIMIT 1